#include "../include/commands/helpcommand.h"

string HelpCommand::execute(const string& command,
                     const vector<string>& args,
                     const vector<string>& opts) {
    auto com_inf = list_commands::get(command);

    // записываем в переменную описание команды
    string description = get<1>(com_inf);
    // записываем все опции, которые имеет команда
    unordered_map<string, string> got_opts = get<2>(com_inf);

    // если хотя бы один флаг не совпадает, команда НЕ ВЫПОЛНЯЕТСЯ
    for (string opt: opts) {
        // если флаг не найден (ни короткий, ни полный)
        if (got_opts[opt] == "") {
            string output = "Flag <b>" + opt + "</b> wasn`t found.";
            return output;
        }
    }

    // к этому моменту мы знаем, что если мы оказались здесь, то все опции правильные

    if (args.size() == 0 && opts.size() == 1) {
        if (opts[0] == "-h" || opts[0] == "--health") {
            return "<br><br>";
        }
        if (opts[0] == "-p" || opts[0] == "--panteleev") {
            return "<br>⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⠀⠀⢸⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⠀⠀<br>\
⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣠⣤⣤⣤⣼⡀⠀⢸⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⠀⠀<br>\
⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴⣿⣿⣿⣿⡿⠿⢿⣿⣶⣾⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⠀⠀<br>\
⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⣠⣿⣿⠛⠁⠀⠀⠀⠀⠀⠀⠘⠿⣷⣄⠀⠀⠀⠀⠀⠀⢸⣿⠀⠀<br>\
⣿⡇⠀⠀⠀⠀⠀⠀⠀⢠⣿⠟⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢹⣿⣆⠀⠀⠀⠀⠀⢸⡇⠀⠀<br>\
⣿⡇⠀⠀⠀⠀⠀⠀⠀⢸⡿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⠀⠀⠀⠀⠀⢸⡇⠀⠀<br>\
⣿⡇⠀⠀⠀⠀⠀⠀⠀⣼⣮⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⠀⠀⠀⠀⠀⢸⡇⠀⠀<br>\
⣿⡇⠀⠀⠀⠀⠀⠀⡀⠻⣿⣤⣀⢀⣀⣀⣠⢀⠀⢀⡤⣖⣀⣰⣿⡿⡀⠀⠀⠀⠀⢸⡇⠀⠀<br>\
⣿⠁⠀⠀⠀⠀⠀⠀⠁⢀⢯⡈⡃⠈⠁⠁⠈⠚⠀⠸⠉⠈⠉⠛⠋⣏⠁⠀⠀⠀⠀⢸⠇⠀⠀<br>\
⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣧⠀⠉⠀⠀⠈⠀⠀⠀⠁⠀⠀⠀⢸⠃⠀⠀⠀⠀⠀⢸⠀⠀⠀<br>\
⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⠙⠀⠀⠀⠀⠀⠂⠠⠴⠆⠀⠀⠀⣾⠁⠀⠀⠀⠀⠀⢸⠀⠀⠀<br>\
⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡀⠀⠀⠀⠤⠤⠤⠀⣀⣰⣦⡆⢰⡿⠀⠀⠀⠀⠀⠀⠘⠀⠀⠀<br>\
⣿⠀⠀⠀⠀⠀⠀⠀⠀⢀⡴⣷⣶⣄⠄⠀⠀⠀⠀⠀⠀⡀⣷⡿⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀<br>\
⣿⠀⠀⠀⠀⠀⠀⠀⣠⣾⡇⠩⣟⢿⣿⡄⠀⢀⡤⠀⠀⣹⣿⣥⣤⣄⣀⡀⠀⠀⠀⠀⠀⠀⠀<br>\
⣿⠀⠀⠀⢀⣠⣤⣾⣿⣿⣿⡀⠀⠑⠝⠛⠛⠻⠿⠿⡾⠟⠀⣿⣿⣿⣿⣿⣿⣶⣶⣤⣄⣀⠀<br>\
⣿⣀⣤⣾⣿⣿⣿⣿⣿⣿⣿⣷⡀⠀⠀⠀⠀⢀⠀⢤⠂⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿<br>\
⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡄⠀⠀⠀⡸⡿⣿⣷⣆⠀⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿<br>\
⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣆⠀⢠⣷⣟⣯⣿⠿⡇⠈⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿<br>\
⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⠘⠹⣿⣿⣿⠀⠁⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿<br>\
⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣆⠀⣿⣿⣿⡤⡀⠀⢹⣿⣿⡟⡉⠙⢿⣿⣿⣿⣿<br>\
⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣶⣿⣿⣟⣻⣆⠀⢸⣿⣿⣧⡁⠀⣸⣿⣿⣿⣿<br>\
⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⣿⣿⣿⣧⠘⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿<br>\
⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡽⣗⣻⣿⣧⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿<br>\
⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣽⣷⣻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿<br>";
        }
    }
    return description;
}
